org/20221220213622-aeppl_and_mixtures.org
:PROPERTIES:
:ID:       c40d2cd2-cd16-4e9c-baab-93e368eb3c0e
:END:
#+title: AePPL, mixtures and conditionals

Probabilistic Programming Languages in Python ask you to use a ad-hoc =Mixture= [[https://docs.pymc.io/en/v5.0.0/api/distributions/generated/pymc.Mixture.html#pymc.Mixture][distribution object]] to build mixture distributions. In [[id:5a5e87b1-558c-43db-ad38-32a073b10351][Aesara]]/[[id:e18d689a-392a-407a-941a-f0ad2d2dc43e][AePPL]] you can express the mixture in different ways.

* Indexing an array

We can define mixture by using a random variable with a discrete support (=Bernoulli=, =Categorical=, etc.) to index an array of random variables:

#+begin_src python :results output
import aeppl
import aesara
import aesara.tensor as at
import numpy as np

srng = at.random.RandomStream(0)

loc = np.array([-1, 0, 1, 2])
N_rv = srng.normal(loc, 1.)

p = np.array([0.2, 0.3, 0.1, 0.4])
I_rv = srng.categorical(p)

Y_rv = N_rv[I_rv]

sample_fn = aesara.function((), Y_rv)
print(sample_fn())


logprob, (y_vv, i_vv) = aeppl.joint_logprob(Y_rv, I_rv)
logprob_fn = aesara.function((y_vv, i_vv), logprob)
print(logprob_fn(10, 0))
#+end_src

#+RESULTS:
: 2.0058770404050943
: -63.02837644563878


* Using =aesara.tensor.where=

We can also define mixtures using =aesara.tensor.where=; the conditional can be based on other random variables:

#+begin_src python :results output
import aeppl
import aesara
import aesara.tensor as at


srng = at.random.RandomStream(0)

x_rv = srng.normal(0, 1)
y_rv = srng.cauchy(0, 1)
i_rv = srng.normal(0, 2)

Y_rv = at.where(at.ge(i_rv, 1.), x_rv, y_rv)

sample_fn = aesara.function((), Y_rv)
print(sample_fn())

logprob, (y_vv, i_vv) = aeppl.joint_logprob(y_rv, i_rv)
logprob_fn = aesara.function((y_vv, i_vv), logprob)
print(logprob_fn(10, -1.))
#+end_src

#+RESULTS:
: 1.4436909546981256
: -7.4969361183599315


* TODO Using =aeara.ifelse.ifelse=

We also [[https://github.com/aesara-devs/aeppl/pull/169][soon]] be able to use =aesara.ifelse= to define mixures in the same way we use =aesara.tensor.where=:

#+begin_src python
import aeppl
import aesara
import aesata.tensor as at


srng = at.random.RandomStream(0)

x_rv = srng.normal(0, 1)
y_rv = srng.cauchy(0, 1)
i_rv = srng.bernoulli(0.5)

Y_rv = aesara.ifelse(i_rv, x_rv, y_rv)

logprob, (y_vv, i_vv) = aeppl.joint_logprob(Y_rv, i_rv)
#+end_src

* Marginalize

In the case of a mixture (where we select a random variable according to probabilities of selection), we often do not care about the posterior distribution of the indexing variable, and would thus like to [[id:630773fc-fe6e-4a2b-a191-2c984c27f963][marginalize over this discrete parameter]].

This is why other PPLs use a =Mixture= distribution to represent mixtures, as the marginalization is baked in the expression of the logdensity.
