20221220213622-aeppl_and_mixtures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-21 Wed 21:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AePPL, mixtures and conditionals</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">AePPL, mixtures and conditionals</h1>
<p>
Probabilistic Programming Languages in Python ask you to use a ad-hoc <code>Mixture</code> <a target='_blank' rel='noopener noreferrer' class='external' href="https://docs.pymc.io/en/v5.0.0/api/distributions/generated/pymc.Mixture.html#pymc.Mixture">distribution object</a> to build mixture distributions. In <a href="20220729163627-aesara.html#ID-5a5e87b1-558c-43db-ad38-32a073b10351">Aesara</a>/<a href="20220824141859-aeppl.html#ID-e18d689a-392a-407a-941a-f0ad2d2dc43e">AePPL</a> you can express the mixture in different ways.
</p>

<div id="outline-container-orga86df81" class="outline-2">
<h2 id="orga86df81">Indexing an array</h2>
<div class="outline-text-2" id="text-orga86df81">
<p>
We can define mixture by using a random variable with a discrete support (<code>Bernoulli</code>, <code>Categorical</code>, etc.) to index an array of random variables:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> aeppl
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesara
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesara.tensor <span style="color: #F0DFAF; font-weight: bold;">as</span> at
<span style="color: #F0DFAF; font-weight: bold;">import</span> numpy <span style="color: #F0DFAF; font-weight: bold;">as</span> np

<span style="color: #DFAF8F;">srng</span> = at.random.RandomStream(0)

<span style="color: #DFAF8F;">loc</span> = np.array([-1, 0, 1, 2])
<span style="color: #DFAF8F;">N_rv</span> = srng.normal(loc, 1.)

<span style="color: #DFAF8F;">p</span> = np.array([0.2, 0.3, 0.1, 0.4])
<span style="color: #DFAF8F;">I_rv</span> = srng.categorical(p)

<span style="color: #DFAF8F;">Y_rv</span> = N_rv[I_rv]

<span style="color: #DFAF8F;">sample_fn</span> = aesara.function((), Y_rv)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(sample_fn())


logprob, (y_vv, i_vv) = aeppl.joint_logprob(Y_rv, I_rv)
<span style="color: #DFAF8F;">logprob_fn</span> = aesara.function((y_vv, i_vv), logprob)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(logprob_fn(10, 0))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbd41ffa" class="outline-2">
<h2 id="orgbd41ffa">Using <code>aesara.tensor.where</code></h2>
<div class="outline-text-2" id="text-orgbd41ffa">
<p>
We can also define mixtures using <code>aesara.tensor.where</code>; the conditional can be based on other random variables:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> aeppl
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesara
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesara.tensor <span style="color: #F0DFAF; font-weight: bold;">as</span> at


<span style="color: #DFAF8F;">srng</span> = at.random.RandomStream(0)

<span style="color: #DFAF8F;">x_rv</span> = srng.normal(0, 1)
<span style="color: #DFAF8F;">y_rv</span> = srng.cauchy(0, 1)
<span style="color: #DFAF8F;">i_rv</span> = srng.normal(0, 2)

<span style="color: #DFAF8F;">Y_rv</span> = at.where(at.ge(i_rv, 1.), x_rv, y_rv)

<span style="color: #DFAF8F;">sample_fn</span> = aesara.function((), Y_rv)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(sample_fn())

logprob, (y_vv, i_vv) = aeppl.joint_logprob(y_rv, i_rv)
<span style="color: #DFAF8F;">logprob_fn</span> = aesara.function((y_vv, i_vv), logprob)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(logprob_fn(10, -1.))
</pre>
</div>
</div>
</div>


<div id="outline-container-org6f3d0af" class="outline-2">
<h2 id="org6f3d0af"><span class="todo TODO">TODO</span> Using <code>aeara.ifelse.ifelse</code></h2>
<div class="outline-text-2" id="text-org6f3d0af">
<p>
We also <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aeppl/pull/169">soon</a> be able to use <code>aesara.ifelse</code> to define mixures in the same way we use <code>aesara.tensor.where</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> aeppl
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesara
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesata.tensor <span style="color: #F0DFAF; font-weight: bold;">as</span> at


<span style="color: #DFAF8F;">srng</span> = at.random.RandomStream(0)

<span style="color: #DFAF8F;">x_rv</span> = srng.normal(0, 1)
<span style="color: #DFAF8F;">y_rv</span> = srng.cauchy(0, 1)
<span style="color: #DFAF8F;">i_rv</span> = srng.bernoulli(0.5)

<span style="color: #DFAF8F;">Y_rv</span> = aesara.ifelse(i_rv, x_rv, y_rv)

logprob, (y_vv, i_vv) = aeppl.joint_logprob(Y_rv, i_rv)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf868ec2" class="outline-2">
<h2 id="orgf868ec2">Marginalize</h2>
<div class="outline-text-2" id="text-orgf868ec2">
<p>
In the case of a mixture (where we select a random variable according to probabilities of selection), we often do not care about the posterior distribution of the indexing variable, and would thus like to <a href="20220824142217-marginalize_over_discrete_parameters.html#ID-630773fc-fe6e-4a2b-a191-2c984c27f963">marginalize over this discrete parameter</a>.
</p>

<p>
This is why other PPLs use a <code>Mixture</code> distribution to represent mixtures, as the marginalization is baked in the expression of the logdensity.
</p>
</div>
</div>

<div id="outline-container-org9acc464" class="outline-2">
<h2 id="org9acc464">Links to this note</h2>
<div class="outline-text-2" id="text-org9acc464">
<ul class="org-ul">
<li><a href="./20221220220656-aeppl_and_marginalization.html">AePPL and marginalization</a></li>
<li><a href="./20220824141859-aeppl.html">AePPL</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>